"""
2. Реализовать проект расчета суммарного расхода ткани на производство одежды. Основная сущность (класс)
этого проекта — одежда, которая может иметь определенное название. К типам одежды в этом проекте относятся
пальто и костюм. У этих типов одежды существуют параметры: размер (для пальто) и рост (для костюма). Это
могут быть обычные числа: V и H, соответственно.

Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто (V/6.5 + 0.5), для
костюма (2 * H + 0.3). Проверить работу этих методов на реальных данных.

Реализовать общий подсчет расхода ткани. Проверить на практике полученные на этом уроке знания: реализовать
абстрактные классы для основных классов проекта, проверить на практике работу декоратора @property.
"""


class Clothes:
    def __init__(self, name):
        self.name = name


class Coat(Clothes):
    def __init__(self, name, size):
        super().__init__(name)
        self.size = size

    @property
    def total(self):
        return self.size / 6.5 + 0.5


class Suit(Clothes):
    def __init__(self, name, growth):
        super().__init__(name)
        self.growth = growth

    @property
    def total(self):
        return 2 * self.growth + 0.3


def total_issue(*args):
    return sum(i.total for i in args)


a1 = Coat('coat_1', 50)
a2 = Suit('suit_1', 170)
a3 = Coat('coat_2', 50)
a4 = Suit('suit_2', 170)
a5 = Coat('coat_3', 50)
print(total_issue(*[a1, a2, a3, a4, a5]))
